backend/app/controllers/api/v1/users_controller.rb

    def create
        @user = User.new(user_params)
        password_salt = BCrypt::Engine.generate_salt
        password_hash = BCrypt::Engine.hash_secret(@user.password, password_salt)

        if @user.save
---
INSERT INTO "users" ("firstname", "lastname", "email", "password", "salt", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def update
        @user = User.find(params[:id])
        if @user
            @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "firstname" = ?, "lastname" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["firstname", "test1"], ["lastname", "test2"], ["updated_at", "2021-08-22 21:19:01.988436"], ["id", 10]]

    def destroy
        @user = User.find(params[:id])
        if @user
            @user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]